blog/2019-02-23/tips-to-survive-the-university-of-waterloo.org
# -*- find-file-hook: make-blogging-mode -*-
#+AUTHOR: David Briggs
#+TITLE: Tips for Surviving the University of Waterloo
#+TAGS: rust tera org-mode
#+OPTIONS: html-style:nil num:nil
<2019-02-23 Sat>
#+ATTR_HTML: target="_blank" 


* Tips for Surviving the University of Waterloo

Now that my brother is in his first year at the University of Waterloo, I was inspired to write about some tips to get you through it.
I've been at the University of Waterloo (abbreviated UW) for just under four years now, and I've come to appreciate the value of investments.
I'm talking about investments that'll ease the burden of the University of Waterloo's relentless work-school cycle.

For those of you who are unfamiliar with UW, it's a university in Canada that specializes in providing industry connections ("co-op")
for its student population. These students will flip-flop every four months between a school term and a work term.
I'll refer to this process as the Co-op cycle (co-operative cycle).

In a school term, a student can expect to juggle job applications, midterm studying, assignments, midterms, interviews, and more.
It's certainly no surprise that this cycle can be brutal, especially for the inexperienced or unorganized.

UW has the ability to warp reality itself. You'll find yourself marvelling at all the free time you have, working a 40+ hour job
with hours of travel time a day. It's a common joke among students to recall their parents extolling the difficulties of a full-time job when you're dealing with 60+ hour spikes in workload (to be fair, these students also do not have children).

When you're in UW's bubble, you may feel like the workload is unreasonable, especially when compared to your perception of other universities.
My rebuttal is this article. You can make investments in yourself and your tools to automate this burden away.

Please note, however, this article will be based on getting through Computer Science at UW, as that is my experience.
However, I'm sure some of the advice will apply to other fields of study or universities.

** Invest: In yourself (warning: philosophy ahead)

The best investment you can make to get through UW is to invest your spare time and resources into bettering yourself.
There's the obvious advice: hit the gym, eat better, and sleep longer. That advice is well elaborated elsewhere.

I think there's some bigger advice that's often less-internalized than it should be.

What I feel is underappreciated is the need to focus on what *you want*, and *determine pathways* to get there. You're probably young and if you're at UW, you're surrounded with opportunity.

This is not new advice, as most self-help resources ask you to set a goal, and sub-goals to work towards it.
This is easy to think about and easy to apply in linear pathways (e.g. you can do assignments one question at a time), but difficult to apply in less linear pathways, like life.

Life winds about. Things happen. You have successes, upsets, and plateaus. It can be easy to get caught up in the moment; survive day-by-day.

Long term planning, by contrast, is more difficult. There are many things working against you here:

1. Failure is something most people don't want to ponder. It's often sickening.
2. It's easy to excuse yourself (and not others!). Your brain is wired to protect itself.
3. It's easy to dream unrealistic dreams; easier to think than act.
4. You're human. You're not "ideal". You will make mistakes, miss things, and probably be hypocritical.

These points center around failures of one kind or another. I obsess over these four points
as they offer great advice on how to get to where *I want to be*. So, with these flaws in mind, what should you do?

First things first, you need to determine *what you want*. I want financial success and a stable career, and
use this a platform for some sort of philanthropy. I'm sort of wired for this stuff, as I've known this from my early teens.
So, unless you've been blessed like me, you'll need to *determine your values* and use those to guide you.
*Note*: If you don't know what you want, that's OK. You should ensure you're always keeping opportunities open for yourself when you figure it out.

Then, you need to make plans. I've developed a system I call the "delta system". I'm sure someone else has invented it prior (or its common knowledge), but in the same way I don't blog unless I've made the blogging platform, I won't follow it. This simple system is then: Measure where you are today, where you were previously, and where you want to be.

The measuring part is obviously an important part. Look critically at your life. If you experienced a failure,
what caused it? If you had a success, what lead to it? Are you happy with plateauing, or can you achieve more?

Now, once you've accessed where you are, determine the delta required. What actions can you take to get closer to your goals?
What *actionable* item could you be doing in the short-term, to invest in long-term success?
For example, if you want long term financial stability, setting up a budget is an immediate delta to achieving it.
Or if your long-term goal is career success, and you're failed previously at communication, your immediate delta is to find advice.
Your later deltas would be to implement identified solutions.

Now, this is simultaneously a little robotic and highly personal, and that's on purpose.
If modern times have shown anything, it's that gamified systems are easier to follow. 
(see: mobile games, snowball debt repayment, Chinese social credit score)

A personal example of this is the process I underwent to get into UW.
I had long wanted a good career, and it was now time to identify pathways. At this time tech was ballooning despite the economic crisis,
and this was a topic I had interest in.

Now, I was a pretty bad junior high-school student, with subpar grades to get into a good university.
I had to get serious. I took to khan-academy and took a serendipitously timed math course in the summer between grades nine and ten.
Great! I had the grades, but I realized I needed more. My next delta would be to build a portfolio, to help me get into UW and land my work tech job.
So I built a portfolio. And then things worked out.

I made the necessary investments, and often little more.
Do keep in mind that this paragraph does not detail the years of blood, sweat, and tears that go into something like this.
A five hundred character "delta system" does not guarantee success, it merely organizes the effort that goes into being successful.

My final note on investing in yourself is just this: Just a Gödel showed a mathematical system cannot prove itself[fn:1],
an imperfect character cannot perfectly determine his own character. You need to surround yourself with positive, supportive people,
and carefully learn from them.

