blog/2019-02-23/tips-to-survive-the-university-of-waterloo.org
** Invest: In your skills

Now that we've made it past personal philosophy, we can talk about more practical matters.
As a UW student, you'll need to compete against your fellow students for coveted positions.
This means you need to *good* at what you do. For CS, in particular, there are a few areas to get good at:

1. You should understand common algorithms data structures, and internalize their concepts.
2. You should be proficient in at least one industry language (One of C/Python/Java/JS[fn:4] is fine), along with proficiency with industry tech.
3. You should understand that getting an interview, doing an interview, and working a full-time job are three separate skills.

So, let's wade deeper.

*** Algorithms & Data Structures

If you're in CS, you really don't have a choice here.
A large part of your education in CS will be to learn about algorithms against data structures, and measuring complexity.
Do your best to gain an intuitive understanding of *why* these things actually work.

I was blessed to have a curious little brother, so a natural framework I use is to distill these things into something a
child could understand. So, for example, why does a (balanced) binary search tree have a =O(log n)= search time?
It's not immediately clear how =log= fits into the picture as most people usually study logarithms in a calculus context.
If you're educated in this area, do try to come up with a good, simple explanation. I would probably say something like:
Well, =log= can be used to measure how many times we can halve something[fn:2], and if you follow an example, you'll
notice that we cut the tree in half each time as we search, until we reach the bottom. (with lots more elaborations)

If you're not in CS, pick these things up. There are a dizzying about of material elsewhere about this,
so my recommendation is to pick a popular introduction to CS and finish it. Then work your way up. Then this stuff will apply better.

So, my advice is:

1. Study and be able to reproduce common algorithms/data structures.
   1. E.g. Can you sort a list of integers? What's an appropriate way to do it? Merge sort, radix sort, heap sort, quicksort? (hint: almost always quicksort)
   2. E.g. What's a linked list? What's a stack? What's a tree? What's a graph? What's a hash table? How can you use these primitives so model problems? Which ones would you choose?
   3. E.g. Here's some spaghetti code, what's the time complexity of it?
2. Understand, and recognize, the importance of converting data structures into other ones. (you most certainly do this all the time).
   1. Why do we convert data structures into one another? What's the advantage of converting a list of words into a radix tree? When is it worth it?
3. Study the memory requirements of data structures/algorithms. This is a science after all, so practical applications are /sometimes/ necessary.


*** Proficiency in at Least One Industry Language & Industry Tech

This actually pretty easy if you're curious about this stuff. Industry languages tend to be the most popular languages,
so you've already picked one up. Proficiency is only gained through practice[fn:3], so keep at making programs.
Once you've gained enough experience, the world is your limit. There are few other professions where the cost to entry is so low.
Don't like something? Screw it, make your own.

Similarly, industry tech tends to be popular ones.
I do recommend using Linux or at least some Unix environment. UW's CS club fee is like $2/term, and you get access to a bunch
of Linux boxes. Even better, install Linux and use it as your daily driver. You'll find some rough edges you'll need to program
around. Besides, it's vital to be comfortable with the command line. It's by far the most productive environment, especially when
you hit a wall in your GUI editor (plug: emacs). You will probably want to understand how to traverse the file system, copy files,
and pipe bash commands together.

Other bits of popular industry tech include docker, react, Django, etc. Look around online for popular frameworks and tools.

*** The Art of the Interview

As mentioned above, there's a reality-warping field in the tech industry which has divorced the industry into the holy trinity
of the Resume, the Interview, and then the actual Work.

There's an immense amount of advice on the internet about all three of these, but here's what personal experience has taught me:

Resume:
1. It must stand out visually but must be familiar.
2. Be as concise as humanly possible, and convey what *you* accomplished.
3. Use active voice. If can stick "by zombies" at the end of the sentence, it won't feel good to the recruiter.  

Interview:
1. Practice beforehand; map your skills and experience to the position.
2. Get comfortable with getting stuff wrong. You won't always get the question the instant it's asked. They'll help you, and learn more about you.
3. Communicate communicate communicate, if you need a second to think, tell them.

Actually working:
1. Be yourself, but don't be a know-it-all. 
2. Ask questions. Fuck up. Learn. That's the point of co-op.
3. Dress nicely and be friendly. If you're introverted like me, take the effort to get to know your co-workers.

** Invest: In your templates

This section will probably yield the best time savings relative to the effort.

In my [[https://dpbriggs.ca/blog/spacemacs-for-fun-and-profit][previous blog article]] I described the importance of having an optimized system for editing text,
and this section will deal with having optimized systems for producing documents.

I've developed a few such templates, and I'll share three of them.

