blog/2019-02-23/tips-to-survive-the-university-of-waterloo.html

<div id="outline-container-orgcf6a98c" class="outline-3">
<h3 id="orgcf6a98c">Invest: In your skills</h3>
<div class="outline-text-3" id="text-orgcf6a98c">
<p>
Now that we've made it past personal philosophy, we can talk about more practical matters.
As a UW student, you'll need to compete against your fellow students for coveted positions.
This means you need to <b>good</b> at what you do. For CS, in particular, there are a few areas to get good at:
</p>

<ol class="org-ol">
<li>You should understand common algorithms data structures, and internalize their concepts.</li>
<li>You should be proficient in at least one industry language (One of C/Python/Java/JS<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> is fine), along with proficiency with industry tech.</li>
<li>You should understand that getting an interview, doing an interview, and working a full-time job are three separate skills.</li>
</ol>

<p>
So, let's wade deeper.
</p>
</div>

<div id="outline-container-orgd19917c" class="outline-4">
<h4 id="orgd19917c">Algorithms &amp; Data Structures</h4>
<div class="outline-text-4" id="text-orgd19917c">
<p>
If you're in CS, you really don't have a choice here.
A large part of your education in CS will be to learn about algorithms against data structures, and measuring complexity.
Do your best to gain an intuitive understanding of <b>why</b> these things actually work.
</p>

<p>
I was blessed to have a curious little brother, so a natural framework I use is to distill these things into something a
child could understand. So, for example, why does a (balanced) binary search tree have a <code>O(log n)</code> search time?
It's not immediately clear how <code>log</code> fits into the picture as most people usually study logarithms in a calculus context.
If you're educated in this area, do try to come up with a good, simple explanation. I would probably say something like:
Well, <code>log</code> can be used to measure how many times we can halve something<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>, and if you follow an example, you'll
notice that we cut the tree in half each time as we search, until we reach the bottom. (with lots more elaborations)
</p>

<p>
If you're not in CS, pick these things up. There are a dizzying about of material elsewhere about this,
so my recommendation is to pick a popular introduction to CS and finish it. Then work your way up. Then this stuff will apply better.
</p>

<p>
So, my advice is:
</p>

<ol class="org-ol">
<li>Study and be able to reproduce common algorithms/data structures.
<ol class="org-ol">
<li>E.g. Can you sort a list of integers? What's an appropriate way to do it? Merge sort, radix sort, heap sort, quicksort? (hint: almost always quicksort)</li>
<li>E.g. What's a linked list? What's a stack? What's a tree? What's a graph? What's a hash table? How can you use these primitives so model problems? Which ones would you choose?</li>
<li>E.g. Here's some spaghetti code, what's the time complexity of it?</li>
</ol></li>
<li>Understand, and recognize, the importance of converting data structures into other ones. (you most certainly do this all the time).
<ol class="org-ol">
<li>Why do we convert data structures into one another? What's the advantage of converting a list of words into a radix tree? When is it worth it?</li>
</ol></li>
<li>Study the memory requirements of data structures/algorithms. This is a science after all, so practical applications are <i>sometimes</i> necessary.</li>
</ol>
</div>
</div>


<div id="outline-container-orgd2b085c" class="outline-4">
<h4 id="orgd2b085c">Proficiency in at Least One Industry Language &amp; Industry Tech</h4>
<div class="outline-text-4" id="text-orgd2b085c">
<p>
This actually pretty easy if you're curious about this stuff. Industry languages tend to be the most popular languages,
so you've already picked one up. Proficiency is only gained through practice<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>, so keep at making programs.
Once you've gained enough experience, the world is your limit. There are few other professions where the cost to entry is so low.
Don't like something? Screw it, make your own.
</p>

<p>
Similarly, industry tech tends to be popular ones.
I do recommend using Linux or at least some Unix environment. UW's CS club fee is like $2/term, and you get access to a bunch
of Linux boxes. Even better, install Linux and use it as your daily driver. You'll find some rough edges you'll need to program
around. Besides, it's vital to be comfortable with the command line. It's by far the most productive environment, especially when
you hit a wall in your GUI editor (plug: emacs). You will probably want to understand how to traverse the file system, copy files,
and pipe bash commands together.
</p>

<p>
Other bits of popular industry tech include docker, react, Django, etc. Look around online for popular frameworks and tools.
</p>
</div>
</div>

<div id="outline-container-org27524b8" class="outline-4">
<h4 id="org27524b8">The Art of the Interview</h4>
<div class="outline-text-4" id="text-org27524b8">
<p>
As mentioned above, there's a reality-warping field in the tech industry which has divorced the industry into the holy trinity
of the Resume, the Interview, and then the actual Work.
</p>

<p>
There's an immense amount of advice on the internet about all three of these, but here's what personal experience has taught me:
</p>

<p>
Resume:
</p>
<ol class="org-ol">
<li>It must stand out visually but must be familiar.</li>
<li>Be as concise as humanly possible, and convey what <b>you</b> accomplished.</li>
<li>Use active voice. If can stick "by zombies" at the end of the sentence, it won't feel good to the recruiter.</li>
</ol>

<p>
Interview:
</p>
<ol class="org-ol">
<li>Practice beforehand; map your skills and experience to the position.</li>
<li>Get comfortable with getting stuff wrong. You won't always get the question the instant it's asked. They'll help you, and learn more about you.</li>
<li>Communicate communicate communicate, if you need a second to think, tell them.</li>
</ol>

<p>
Actually working:
</p>
<ol class="org-ol">
<li>Be yourself, but don't be a know-it-all.</li>
<li>Ask questions. Fuck up. Learn. That's the point of co-op.</li>
<li>Dress nicely and be friendly. If you're introverted like me, take the effort to get to know your co-workers.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org60c62ac" class="outline-3">
<h3 id="org60c62ac">Invest: In your templates</h3>
<div class="outline-text-3" id="text-org60c62ac">
<p>
This section will probably yield the best time savings relative to the effort.
</p>

<p>
In my <a href="https://dpbriggs.ca/blog/spacemacs-for-fun-and-profit">previous blog article</a> I described the importance of having an optimized system for editing text,
and this section will deal with having optimized systems for producing documents.
</p>

<p>
I've developed a few such templates, and I'll share three of them.
</p>
</div>
