blog/2019-02-23/tips-to-survive-the-university-of-waterloo.org
*** The Resume and Cover Letter

Before I get into this, I highly recommend using =LaTeX= or similar templating tools.
The websites are nice and easy, but everyone uses it so you may not stand out.
I keep my templates in source control and as its text, I can do dirty things to it with emacs.

This is probably my most complex template, as it contains several hundred lines of commented out
sections that I add in or remove depending on the context. For example, my resume source has a bunch of these blocks:

#+begin_src latex
%% \entry
%%     {2015}
%%     {REPORT ON TECHNOLOGY IN THE CLASSROOM (MSAC)}
%%     {}
%%     {I coordinated, managed, and shipped a report on technology in the classroom to the Ontario Minister of Education. \\
%%     Key Skills: \textit{Effective Communication, Problem Solving, Analytical thinking}}
#+end_src

Depending on the job or position, I toggle these sections to better fit my resume to the job. I then compile it and submit it.

Of course, a template also has to have variables. This is pretty easy in =LaTeX=. In my cover letter, you'll find a bunch of things like:

#+begin_src latex
\newcommand{\positionTitle}{Developer}
\newcommand{\recruiterName}{Hiring Team}
\newcommand{\companyName}{COMPANY}
\newcommand{\sppp}{\hspace{20pt}}
#+end_src

And use it like this:

#+begin_src latex
Regarding the \positionTitle{} position currently advertised on
#+end_src

Obviously, for more important applications, I add new handwritten sections and save them for future use.

*** Assignments

This one is pretty easy if you're using =org-mode=. I usually just copy/paste the header of a previous assignment, which looks like:

#+begin_src org
#+TITLE: CO487 - A2
#+AUTHOR: David Briggs (09876432)
#+EMAIL: dpbriggs@edu.uwaterloo.ca

#+OPTIONS: toc:nil num:0
#+LATEX_HEADER: \usepackage{mathtools}

\setlength{\parindent}{0em}
\newcommand{\eqdef}{\vcentcolon=}
#+end_src

Otherwise, you'll probably need to use =LaTeX= for your CS assignments.
Develop a common enough document and reuse it later.

*** Work Term Report

If you're not familiar, at UW, you need to write a report on something relating to your work term.
The grade weighting is all messed up, and the format is weighted as much as the content itself.
So, if you have a perfectly formatted template, you can write a few thousand words of hot garbage
and pass the assignment.

So, I built an extensive, nearly perfectly formatted template with =LaTeX= and =org-mode=.
Nearly everything is automated. So when I need to write one, I fill in the variable section (see below), and then spew bullshit.

#+begin_src latex
\newcommand{\theTitle}{Neato Documentation and Tutorial}
\newcommand{\bossCalling}{Mr.}
\newcommand{\bossFirst}{Foo}
\newcommand{\bossLast}{Bar}
\newcommand{\companyCity}{Waterloo}
\newcommand{\companyCityProvince}{\companyCity{}, Ontario}
\newcommand{\companyName}{SomethingInUW}
\newcommand{\companyPostalCode}{N2L 0Z0}
\newcommand{\companyProvinceShort}{ON}
\newcommand{\companyStreet}{Something Dr}
\newcommand{\currentProgram}{Computer Science}
% … snip (more variables/latex) … %
#+end_src

And that's it. Develop one of these templates in your 1B coop and it'll pay dividends for years to come.


** Conclusion

All said UW is like any university, plus the constant job-finding part.
It's a lot of work, but if you make good investments, it's way easier.

David Briggs

[fn:1] paraphrasing
[fn:2] base 2
[fn:3] As reading two rust books has taught me…
[fn:4] :shudders:
