blog/2019-02-23/tips-to-survive-the-university-of-waterloo.html

<div id="outline-container-org33680d9" class="outline-4">
<h4 id="org33680d9">The Resume and Cover Letter</h4>
<div class="outline-text-4" id="text-org33680d9">
<p>
Before I get into this, I highly recommend using <code>LaTeX</code> or similar templating tools.
The websites are nice and easy, but everyone uses it so you may not stand out.
I keep my templates in source control and as its text, I can do dirty things to it with emacs.
</p>

<p>
This is probably my most complex template, as it contains several hundred lines of commented out
sections that I add in or remove depending on the context. For example, my resume source has a bunch of these blocks:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #6C8C6C;">%% </span><span style="color: #8CAC8C;">\entry</span>
<span style="color: #6C8C6C;">%%     </span><span style="color: #8CAC8C;">{2015}</span>
<span style="color: #6C8C6C;">%%     </span><span style="color: #8CAC8C;">{REPORT ON TECHNOLOGY IN THE CLASSROOM (MSAC)}</span>
<span style="color: #6C8C6C;">%%     </span><span style="color: #8CAC8C;">{}</span>
<span style="color: #6C8C6C;">%%     </span><span style="color: #8CAC8C;">{I coordinated, managed, and shipped a report on technology in the classroom to the Ontario Minister of Education. \\</span>
<span style="color: #6C8C6C;">%%     </span><span style="color: #8CAC8C;">Key Skills: </span><span style="color: #8CAC8C;">\textit</span><span style="color: #8CAC8C;">{Effective Communication, Problem Solving, Analytical thinking}}</span>
</pre>
</div>

<p>
Depending on the job or position, I toggle these sections to better fit my resume to the job. I then compile it and submit it.
</p>

<p>
Of course, a template also has to have variables. This is pretty easy in <code>LaTeX</code>. In my cover letter, you'll find a bunch of things like:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\positionTitle</span>}{<span style="color: #A0EDF0;">Developer</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\recruiterName</span>}{<span style="color: #A0EDF0;">Hiring Team</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyName</span>}{<span style="color: #A0EDF0;">COMPANY</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\sppp</span>}{<span style="color: #A0EDF0;">\hspace</span><span style="color: #A0EDF0;">{20pt}</span>}
</pre>
</div>

<p>
And use it like this:
</p>

<div class="org-src-container">
<pre class="src src-latex">Regarding the <span style="color: #FDECBC;">\positionTitle</span>{} position currently advertised on
</pre>
</div>

<p>
Obviously, for more important applications, I add new handwritten sections and save them for future use.
</p>
</div>
</div>

<div id="outline-container-orgce1b268" class="outline-4">
<h4 id="orgce1b268">Assignments</h4>
<div class="outline-text-4" id="text-orgce1b268">
<p>
This one is pretty easy if you're using <code>org-mode</code>. I usually just copy/paste the header of a previous assignment, which looks like:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b3b3b3;">#+TITLE:</span> <span style="color: #afeeee; font-weight: bold;">CO487 - A2</span>
<span style="color: #b3b3b3;">#+AUTHOR:</span> <span style="color: #afeeee;">David Briggs (09876432)</span>
<span style="color: #b3b3b3;">#+EMAIL:</span> <span style="color: #afeeee;">dpbriggs@edu.uwaterloo.ca</span>

<span style="color: #8CAC8C;">#+OPTIONS: toc:nil num:0</span>
<span style="color: #8CAC8C;">#+LATEX_HEADER: \usepackage{mathtools}</span>

\setlength{\parindent}{0em}
\newcommand{\eqdef}{\vcentcolon=}
</pre>
</div>

<p>
Otherwise, you'll probably need to use <code>LaTeX</code> for your CS assignments.
Develop a common enough document and reuse it later.
</p>
</div>
</div>

<div id="outline-container-orgf1724b2" class="outline-4">
<h4 id="orgf1724b2">Work Term Report</h4>
<div class="outline-text-4" id="text-orgf1724b2">
<p>
If you're not familiar, at UW, you need to write a report on something relating to your work term.
The grade weighting is all messed up, and the format is weighted as much as the content itself.
So, if you have a perfectly formatted template, you can write a few thousand words of hot garbage
and pass the assignment.
</p>

<p>
So, I built an extensive, nearly perfectly formatted template with <code>LaTeX</code> and <code>org-mode</code>.
Nearly everything is automated. So when I need to write one, I fill in the variable section (see below), and then spew bullshit.
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\theTitle</span>}{<span style="color: #A0EDF0;">Neato Documentation and Tutorial</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\bossCalling</span>}{<span style="color: #A0EDF0;">Mr.</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\bossFirst</span>}{<span style="color: #A0EDF0;">Foo</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\bossLast</span>}{<span style="color: #A0EDF0;">Bar</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyCity</span>}{<span style="color: #A0EDF0;">Waterloo</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyCityProvince</span>}{<span style="color: #A0EDF0;">\companyCity</span><span style="color: #A0EDF0;">{}, Ontario</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyName</span>}{<span style="color: #A0EDF0;">SomethingInUW</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyPostalCode</span>}{<span style="color: #A0EDF0;">N2L 0Z0</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyProvinceShort</span>}{<span style="color: #A0EDF0;">ON</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\companyStreet</span>}{<span style="color: #A0EDF0;">Something Dr</span>}
<span style="color: #FDECBC; font-weight: bold;">\newcommand</span>{<span style="color: #A0EDF0;">\currentProgram</span>}{<span style="color: #A0EDF0;">Computer Science</span>}
<span style="color: #6C8C6C;">% </span><span style="color: #8CAC8C;">&#8230; snip (more variables/latex) &#8230; %</span>
</pre>
</div>

<p>
And that's it. Develop one of these templates in your 1B coop and it'll pay dividends for years to come.
</p>
</div>
</div>
</div>


<div id="outline-container-orgbad553e" class="outline-3">
<h3 id="orgbad553e">Conclusion</h3>
<div class="outline-text-3" id="text-orgbad553e">
<p>
All said UW is like any university, plus the constant job-finding part.
It's a lot of work, but if you make good investments, it's way easier.
</p>

<p>
David Briggs
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
paraphrasing
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
:shudders:
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
base 2
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
As reading two rust books has taught me…
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2019-02-24 Sun 15:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
